import './publicOffer.scss';

const PublicOffer = () => {
  return (
    <div className="public-offer content__public-offer">
      <div className="public-offer__wrapper">
        <p>
          <strong>1. Основні терміни і поняття</strong><br />
          1.1. У цій публічній оферті, якщо з контексту не випливає інше, наведені нижче терміни з великої літери мають наступні значення.<br />
          1.2. Кур&#39;єрська служба - особи, які надають послуги з доставки товарів від імені Продавця або співробітники Продавця.<br />
          1.3. Цех-піцерія - місце виготовлення товарів. Адреса Цехи-піцерії (Цехів-піцерій) вказується на Сайті.<br />
          1.4. Продавець - компанія, яка реалізує Товар, представлений на Сайті, але не обмежений тільки Сайтом.<br />
          1.5. Покупець - будь-яка дієздатна особа, яка має намір замовити або придбати, або замовляє, що купує або використовує Товари виключно для особистих, сімейних, домашніх чи інших потреб, не пов&#39;язаних із здійсненням підприємницької діяльності.<br />
          1.5. Сайт - веб-сторінка (веб-сторінки) Продавця, розташована (і) за адресою ...<br />
          1.6. Телефон - +38 (099) 999 99 99.<br />
          1.7. Товари - перелік продукції Продавця, який представлений на Сайті. Товари можуть відрізнятися від зображення на Сайті. Споживчі властивості товару вказані на Сайті.<br />
          1.8. Для цілей цієї оферти терміни та визначення в числі відносяться також і до термінів і визначень у множині.<br />
          <br />
          <strong>2. Загальні положення</strong><br />
          2.1. Договірні відносини між продавцем і покупцем оформляються у вигляді Договору публічної оферти (далі - Договір).<br />
          2.2. Договір є публічним, тобто відповідно до статей 633, 641 Цивільного кодексу України його умови однакові для всіх Покупців. При повній згоді з даним Договором Покупець приймає умови і порядок оформлення замовлення, оплати та доставки Товару Продавцем, відповідальності за невиконання умов цього Договору.<br />
          2.3. Покупець зобов&#39;язується ознайомитися з умовами даного Договору, а також з інформацією, вказаною на Сайті.<br />
          2.4. Продавець залишає за собою право вносити зміни в даний Договір і відповідно до цього Покупець зобов&#39;язується самостійно відслідковувати наявність змін в цьому Договорі.<br />
          2.5. При оформленні замовлення Товарів на Сайті Покупець тим самим підтверджує, що він виконав обов&#39;язки, передбачені пунктом 2.3. справжньої угоди.<br />
          2.6. У разі припинення дії визначеним пунктом Договору, всі інші пункти залишаються в силі і Договір діє без урахування такого пункту.<br />
          2.7. Умови цього Договору діють для Сайту, якщо інше прямо не передбачено цим Договором.<br />
          <br />
          <strong>3. Предмет Договору</strong><br />
          3.1. Продавець зобов&#39;язується на умовах та в порядку, визначених цим Договором, продати товар на основі замовлення, оформленого Покупцем, а Покупець зобов&#39;язується на умовах та в порядку, визначених цим Договором, придбати Товар і сплатити за нього грошові кошти.<br />
          3.2. Покупець отримує право власності на замовлений ним Товар в момент фактичної передачі Товару та оплати Покупцем його повної вартості. Після цього ризик пошкодження і випадкової загибелі Товару лягає на Покупця.<br />
          <br />
          <strong>4. Повідомлення Покупця</strong><br />
          4.1. Продавець має право дзвонити або відправляти сервісні повідомлення, тим самим інформуючи Покупця про вироблений ним замовлення, про склад продукції і на якому етапі приготування він знаходиться, про готовність замовлення. В такому випадку Покупець проінформований про належне виконання Продавцем своїх зобов&#39;язань за Договором.<br />
          <br />
          <strong>5. Оформлення замовлення Товарів</strong><br />
          5.1. Замовлення Покупця може бути оформлений по Телефону, передбаченому пунктом 1.6. цього Договору, або на Сайті, передбаченому пунктом 1.5. справжньої угоди.<br />
          5.2. Покупець зобов&#39;язується надати достовірні дані, необхідні для виконання цього Договору.<br />
          5.3. У разі виникнення у Покупця додаткових питань, що стосуються Товарів, перед оформленням замовлення, Покупець повинен звернутися до Продавця по Телефону або особисто, в разі, якщо Покупець виявив бажання отримати Товар шляхом самовивозу, для отримання необхідної інформації, відповідно до режиму роботи, зазначеним на сайті.<br />
          5.4. Покупець може замовити тільки той Товар, який є в наявності у Продавця в момент оформлення замовлення.<br />
          5.5. Покупець має право видалити інгредієнти зі складу Товару, при наявності технічної можливості, при цьому ціна на Товар не змінюється.<br />
          5.6. Покупець не має права змінювати склад замовлення після його оформлення на Сайті.<br />
          5.7. При оформленні замовлення по Телефону Продавець має право здійснювати аудіозапис телефонної розмови з Покупцем, якщо зазначені дії необхідні Продавцю для виконання обов&#39;язків, передбачених цим Договором та оцінки якості послуг, що надаються, без отримання від Покупця згоди на вчинення зазначених дій.<br />
          5.8. Продавець має право тимчасово призупинити прийом замовлень Товарів в разі технічних неполадок або відсутності інгредієнтів, необхідних для виготовлення Товарів.<br />
          <br />
          <strong>6. Доставка Товарів</strong><br />
          6.1. Доставка товару здійснюється Кур&#39;єрської службою за фактичною адресою, вказаною Покупцем при оформленні замовлення, або самовивозом Покупця, якщо останній виявив таке бажання.<br />
          6.2. Доставка Товарів в межах зони доставки здійснюється відповідно до режиму роботи продавця, зазначеним на Сайті.<br />
          6.3. Доставка Товарів за адресами, які не входять в зону доставки, не здійснюється.<br />
          6.4. У разі порушення встановлених термінів доставки Товарів, в силу обставин непереборної сили (форс-мажор) Продавець не вважається Стороною, яка прострочила доставку.<br />
          6.5. Доставка здійснюється при замовленні Товару на суму мінімального замовлення. Мінімальна сума визначається Продавцем в односторонньому порядку і вказується на Сайті.<br />
          6.6. Продавець має право відмовитися від виконання Договору, якщо Кур&#39;єрська служба після прибуття за фактичною адресою доставки Покупця, не може здійснити фактичну передачу Товару з вини Покупця. Наприклад: Покупець вказав невірний фактична адреса доставки, не відповідає на телефонний дзвінок, не відчиняє двері і т.д.<br />
          <br />
          <strong>7. Оплата Товарів</strong><br />
          7.1. Ціни на Товари встановлюються Продавцем в односторонньому порядку і вказуються на Сайті.<br />
          7.2. Ціна на замовлений Покупцем Товар зміні не підлягає.<br />
          7.2. Оплата Товарів Покупцем проводиться в грошовій одиниці України (гривні) у такий спосіб:<br />
          - за фактом отримання Товару готівкою;<br />
          - безготівковим розрахунком банківською картою на Сайті.<br />
          7.3. Видача або направлення Покупцю касового чека може здійснюватися на паперовому носії при фактичній оплаті Товару готівкою або банківською картою.<br />
          <br />
          <strong>8. Повернення і обмін Товару</strong><br />
          8.1. Повернення Товару належної якості не допускається, так Товар має індивідуально-визначені ознаки і може бути використаний виключно купують його Покупцем.<br />
          8.2. Продавець зобов&#39;язаний передати покупцеві Товари, які повністю відповідають його замовлення, якість яких відповідає інформації, представленої Покупцеві при укладанні Договору, а також інформації, доведеної до його відома при передачі Товару (на етикетці або вкладиші, прикріплених до Товарів або їх упаковці, або іншими способами, передбаченими для окремих видів товарів).<br />
          8.3. Покупець зобов&#39;язується перевірити відповідність отриманих Товарів своє замовлення, комплектність і відсутність претензій до зовнішнього вигляду безпосередньо за фактом отримання Товарів.<br />
          8.4. У разі отримання неякісних Товарів, або невідповідності отриманих Товарів замовленим (відсутність заявлених інгредієнтів в Товарі), Покупець має право вимагати заміни таких Товарів на Товари належної якості за фактом отримання Товарів.<br />
          8.5. У разі невиконання порядку пред&#39;явлення претензії Покупця за зовнішнім виглядом Товарів і їх комплектності, передбачених пунктами 8.3 та 8.4 цього Договору, претензії не приймаються.<br />
          <br />
          <strong>9. Форс-мажор</strong><br />
          9.1. Будь-яка із Сторін звільняється від відповідальності за повне або часткове невиконання своїх зобов&#39;язань за Договором, якщо це невиконання було викликано обставинами непереборної сили (форс-мажор). Форс-мажор означають надзвичайні події та обставини, які Сторони не могли ні передбачити, ні запобігти розумними засобами. Такі надзвичайні події або обставини включають в себе, зокрема: страйки; повені; пожежі; карантин; землетрусу; інші стихійні лиха; акти тероризму; тривалі перерви в роботі транспорту; пробки на дорогах; заборона (обмеження) експорту / імпорту; зміни в національному законодавстві; збій в роботі технічних систем, що використовуються Продавцем; злочинні дії третіх осіб по відношенню до Продавця; загроза війни; військові дії тощо<br />
          <br />
          <strong>10. Відповідальність Сторін</strong><br />
          10.1. Продавець не несе відповідальності за шкоду, заподіяну Покупцеві внаслідок неналежного використання ним Товарів, придбаних у Продавця.<br />
          10.2. Продавець не відповідає за збитки Покупця, що виникли в результаті неправильного заповнення замовлення, в тому числі неправильно зазначених своїх даних.<br />
          10.3. У разі зловживання Покупцем правами споживача, якщо Покупець відмовився від прийняття і / або оплати замовленого і доставленого Товару, Продавець може реалізувати своє право на самозахист, а саме: не приймати надалі від нього замовлення.<br />
          10.4. У разі односторонньої відмови Продавця від виконання Договору відповідно до пункту 6.6. цього Договору, Продавець може реалізувати своє право на самозахист, стягнути збитки з Покупця. У разі, якщо Покупець оплатив Товар до його доставки, сплачена сума не повертається.<br />
          <br />
          <strong>11. Термін дії цього Договору</strong><br />
          11.1. Цей Договір вважається укладеним у момент завершення оформлення замовлення Покупцем і підтвердження прийняття замовлення до виконання Продавцем.<br />
          11.2. Договір діє до повного виконання Сторонами всіх умов цього Договору.
        </p>
      </div>
    </div>
  );
}

export default PublicOffer;